src/notes/increasing-minimum-wage-by-50-percent-isnt-going-to-work.org
#+TITLE: Increasing Minimum Wage By 50% Is Not Going To Work
#+DATE: 2016-08-23
#+OPTIONS: toc:nil

On 15th August 2016, the state government proposed to increase the minimum wage for unskilled workers by 50%. I am curious -- why not increase by 100%, why not by 200%, or for that matter why not by 500% and make everybody rich? There will be no poverty as per the socialist logic.

Some will argue that I am foolish to propose a 500% increment. Yes, I am -- and so is anyone who proposes a 50% hike without thinking through the consequences.

Before I explain further, consider the reaction from the business community itself. The government's own trade wing was unhappy with the proposal and threatened to go on strike.

#+begin_quote
The decision to hike minimum wages by 50 per cent did not go down well with the trade wing, which threatened to call a strike claiming the step would lead to layoffs and affect business.
#+end_quote

#+begin_quote
Terming the decision as "unjustified", trade associations said the upward revision in wages would not only lead to laying off workers but also result in complete industrial and trade shutdown in the capital.
#+end_quote

The state government also asked the central government to emulate this move and increase minimum wages by 50% nationally. But did anyone give thought to the concerns of traders? From where would this additional money come? I could think of only four ways in which traders can compensate for this additional load:

1. No compensation, just accept the reduced profit (trader unhappy)
2. Pass on the cost to their customers (inflation, consumer unhappy)
3. Work more, i.e. sell more to maintain the same profit (trader unhappy)
4. Reduce workers and ask the remaining ones to work more (unemployment, workers unhappy)

There are three parties -- workers, traders (business owners) and consumers. There is no way we can make all three parties happy. At least I am not aware of such a way in a socialist scheme.

Such rapid changes hurt the economy because if the traders are unhappy, no new investment will come to the state, unemployment will increase, and this will also add to inflation. Everything is connected.

There are also many advantages of rapid movement. One is that we get to learn quickly, but only if we want to. I appreciate out-of-the-box policy decisions, but at the same time it is concerning when governments do not learn from past experiments. Consider the even-odd vehicle formula, public grievance forums that descended into chaos, or forcing ride-hailing companies to comply with standard government tariffs.

The even-odd scheme was a massive gain for auto-rickshaw operators. It was positioned as a success on paper. The forced compliance of ride-hailing tariffs was considered great from a socialist angle. But it brought criticism from all quarters. Why? People were initially happy, but within a day they realised that the number of available cabs had reduced, resulting in long waiting hours.

This is pure economics. But all of this is good only if we want to learn.
