docs/notes/increasing-minimum-wage-by-50-percent-isnt-going-to-work.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!--  -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Increasing Minimum Wage By 50% Is Not Going To Work</title>
<meta name="author" content="Pankaj Jangid" />
<meta name="description" content="If a 50% minimum wage hike is good, why not 500%? Walking through the downstream effects on employers, employment, and prices that well-meaning wage policy tends to ignore." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />

<link rel="canonical" href="https://jangid.info/notes/increasing-minimum-wage-by-50-percent-isnt-going-to-work.html"/>
<meta name="description" content="If a 50% minimum wage hike is good, why not 500%? Walking through the downstream effects on employers, employment, and prices that well-meaning wage policy tends to ignore."/>
<meta property="og:type" content="article"/>
<meta property="og:site_name" content="Pankaj Jangid"/>
<meta property="og:title" content="Increasing Minimum Wage By 50% Is Not Going To Work"/>
<meta property="og:description" content="If a 50% minimum wage hike is good, why not 500%? Walking through the downstream effects on employers, employment, and prices that well-meaning wage policy tends to ignore."/>
<meta property="og:url" content="https://jangid.info/notes/increasing-minimum-wage-by-50-percent-isnt-going-to-work.html"/>
<meta name="twitter:card" content="summary"/>
<meta name="twitter:site" content="@jangid"/>
<meta name="twitter:title" content="Increasing Minimum Wage By 50% Is Not Going To Work"/>
<meta name="twitter:description" content="If a 50% minimum wage hike is good, why not 500%? Walking through the downstream effects on employers, employment, and prices that well-meaning wage policy tends to ignore."/>
<link rel="alternate" type="application/rss+xml" title="Pankaj Jangid — Notes" href="/notes/feed.xml"/>
</head>
<body>
<div id="preamble" class="status">
<nav class="site-nav"><a href="/">Home</a><a href="/notes/">Notes</a></nav>
</div>
<div id="content" class="content">
<p class="eyebrow"><a href="/notes/tags/governance.html">governance</a><span class="sep">·</span><a href="/notes/tags/india.html">india</a></p><h1 class="title">Increasing Minimum Wage By 50% Is Not Going To Work</h1><p class="byline">Published 23 Aug 2016</p>
<p>
On 15th August 2016, the state government proposed to increase the minimum wage for unskilled workers by 50%. I am curious &ndash; why not increase by 100%, why not by 200%, or for that matter why not by 500% and make everybody rich? There will be no poverty as per the socialist logic.
</p>

<p>
Some will argue that I am foolish to propose a 500% increment. Yes, I am &ndash; and so is anyone who proposes a 50% hike without thinking through the consequences.
</p>

<p>
Before I explain further, consider the reaction from the business community itself. The government's own trade wing was unhappy with the proposal and threatened to go on strike.
</p>

<blockquote>
<p>
The decision to hike minimum wages by 50 per cent did not go down well with the trade wing, which threatened to call a strike claiming the step would lead to layoffs and affect business.
</p>
</blockquote>

<blockquote>
<p>
Terming the decision as "unjustified", trade associations said the upward revision in wages would not only lead to laying off workers but also result in complete industrial and trade shutdown in the capital.
</p>
</blockquote>

<p>
The state government also asked the central government to emulate this move and increase minimum wages by 50% nationally. But did anyone give thought to the concerns of traders? From where would this additional money come? I could think of only four ways in which traders can compensate for this additional load:
</p>

<ol class="org-ol">
<li>No compensation, just accept the reduced profit (trader unhappy)</li>
<li>Pass on the cost to their customers (inflation, consumer unhappy)</li>
<li>Work more, i.e. sell more to maintain the same profit (trader unhappy)</li>
<li>Reduce workers and ask the remaining ones to work more (unemployment, workers unhappy)</li>
</ol>

<p>
There are three parties &ndash; workers, traders (business owners) and consumers. There is no way we can make all three parties happy. At least I am not aware of such a way in a socialist scheme.
</p>

<p>
Such rapid changes hurt the economy because if the traders are unhappy, no new investment will come to the state, unemployment will increase, and this will also add to inflation. Everything is connected.
</p>

<p>
There are also many advantages of rapid movement. One is that we get to learn quickly, but only if we want to. I appreciate out-of-the-box policy decisions, but at the same time it is concerning when governments do not learn from past experiments. Consider the even-odd vehicle formula, public grievance forums that descended into chaos, or forcing ride-hailing companies to comply with standard government tariffs.
</p>

<p>
The even-odd scheme was a massive gain for auto-rickshaw operators. It was positioned as a success on paper. The forced compliance of ride-hailing tariffs was considered great from a socialist angle. But it brought criticism from all quarters. Why? People were initially happy, but within a day they realised that the number of available cabs had reduced, resulting in long waiting hours.
</p>

<p>
This is pure economics. But all of this is good only if we want to learn.
</p>
</div>
<div id="postamble" class="status">
<nav class="prev-next"><a class="newer" href="./emacs-macos-contacts.html"><span class="label">Newer</span><span class="title">&larr; MacOS Contacts in Emacs</span></a><a class="older" href="./karamchand-and-byomkesh-bakshi-were-the-best-detectives.html"><span class="label">Older</span><span class="title">Karamchand and Byomkesh Bakshi Were the Best Detectives &rarr;</span></a></nav><div class="site-footer"><span><a href="mailto:pankaj@jangid.info">pankaj@jangid.info</a></span><span class="sep">·</span><span><a href="https://x.com/jangid" rel="me">X</a></span><span class="sep">·</span><span><a href="https://www.linkedin.com/in/pankaj-jangid/" rel="me">LinkedIn</a></span><span class="sep">·</span><span><a href="https://github.com/jangid" rel="me">GitHub</a></span></div><div class="legal">&copy; 2005&ndash;2026 Pankaj Jangid. Prose licensed under <a href="https://creativecommons.org/licenses/by/4.0/">CC BY 4.0</a>; code snippets under the MIT License.</div>
</div>
</body>
</html>
